tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU database manager
brew "gdbm"
# Mozilla CA certificate store
brew "ca-certificates"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Package for scientific computing with Python
brew "numpy"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Utilities for converting macOS DMG images
brew "dmg2img"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Identify or delete duplicate files
brew "fdupes"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# HTTP/2 C Library
brew "libnghttp2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# VP8/VP9 video codec
brew "libvpx"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Prints information and tests integrity of JPEG/JFIF files
brew "jpeginfo"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Realtime console network usage monitor
brew "nload"
# Platform built on V8 to build network applications
brew "node", link: false
# Emulator for x86 and PowerPC
brew "qemu"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# File system snapshot utility (based on rsync)
brew "rsnapshot"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Get, set, and list display resolution
brew "screenresolution"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compressed read-only file system for Linux
brew "squashfs"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualizer
cask "daisydisk"
# Universal database tool and SQL client
cask "dbeaver-community"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Finds duplicate files in a computer system
cask "dupeguru"
# Free and open-source media player
cask "iina"
# Keyboard customizer
cask "karabiner-elements"
# Password manager compatible with KeePass
cask "keeweb"
# Audio tagger focusing on efficiency
cask "kid3"
# Warns about malware, adware and spyware
cask "malwarebytes"
# Open-source code snippets manager for developers
cask "masscode"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
cask "parsec"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
cask "scidavis"
# Video chat, voice call and instant messaging application
cask "skype"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Remote desktop software
cask "x2goclient"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Apple Configurator 2", id: 1037126344
mas "EasyFind", id: 411673888
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Todoist", id: 585829637
