tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "martido/graph"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Library for complex text layout
brew "libraqm"
# Package for scientific computing with Python
brew "numpy"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Utilities for converting macOS DMG images
brew "dmg2img"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Identify or delete duplicate files
brew "fdupes"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# High performance message passing library
brew "open-mpi"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-driven, interactive function plotting
brew "gnuplot"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Prints information and tests integrity of JPEG/JFIF files
brew "jpeginfo"
# Spice circuit simulator as shared library
brew "libngspice"
# General purpose TCP-IP emulator
brew "libslirp"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Spice circuit simulator
brew "ngspice"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Emulator for x86 and PowerPC
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# File system snapshot utility (based on rsync)
brew "rsnapshot"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Get, set, and list display resolution
brew "screenresolution"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compressed read-only file system for Linux
brew "squashfs"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Finds duplicate files in a computer system
cask "dupeguru"
# Web browser
cask "firefox"
# Free and open-source media player
cask "iina"
# Keyboard customizer
cask "karabiner-elements"
# Password manager compatible with KeePass
cask "keeweb"
# Audio tagger focusing on efficiency
cask "kid3"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Warns about malware, adware and spyware
cask "malwarebytes"
# Simple and elegant markdown editor
cask "mark-text"
# Open-source code snippets manager for developers
cask "masscode"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Remote desktop
cask "parsec"
# Application for scientific data analysis and visualization
cask "scidavis"
# Video chat, voice call and instant messaging application
cask "skype"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Network protocol analyzer
cask "wireshark"
# Remote desktop software
cask "x2goclient"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
